app/Http/Middleware/LanguageMiddleware.php

select * from `languages` where `is_default` = 1 limit 1
---
    public function getCode()
    {
        if (session()->has('lang')) {
            return session('lang');
        }
        $language = Language::where('is_default', 1)->first();