app/Http/Controllers/User/CryptoController.php

	public function index($id)
	{
		$user = Auth::user();
		$coin = Cryptocurrency::whereId(decrypt($id))->whereStatus(1)->firstOrFail();
		$wallet = Cryptowallet::whereCoinId($coin->id)->whereUserId($user->id)->whereStatus(1)->first();
---
select * from `cryptocurrencies` where `id` = 2 and `status` = 1 limit 1
select * from `cryptowallets` where `coin_id` = 2 and `user_id` = 1 and `status` = 1 limit 1

		}

		$pageTitle = $coin->name.' Wallet';
		$trx = Cryptotrx::where('user_id', $user->id)->whereCoin_id($coin->id)->take(5)->latest()->get();
---
select * from `cryptotrxes` where `user_id` = 1 and `coin_id` = 2 order by `created_at` desc limit 5