app/Http/Controllers/User/EducationController.php

select sum(`price`) as aggregate from `orders` where `user_id` = 1 and `type` = 'education' and `product_logo` = 'gotv'
select sum(`price`) as aggregate from `orders` where `user_id` = 1 and `type` = 'education' and `product_logo` = 'startimes'
select sum(`price`) as aggregate from `orders` where `user_id` = 1 and `type` = 'education' and `product_logo` = 'showmax'
select sum(`price`) as aggregate from `orders` where `user_id` = 1 and `type` = 'education' and `product_logo` = 'dstv'
select count(*) as aggregate from `orders` where `user_id` = 1 and `type` = 'education' and (`trx` LIKE '%%')
---
    public function buy_education(Request $request)
    {
        $pageTitle = 'Pay education Fee';
        $networks =  '[
            {
                "name": "WAEC",
                "description": "WAEC Registration PIN",
                "logo": "waec.png",
                "serviceID": "waec-registration",
                "class": "card bg-primary bg-opacity-10 border-primary border-opacity-40"
            },
            {
                "name": "WAEC",
                "description": "WAEC Result Checker PIN",
                "logo": "waec.png",
                "serviceID": "waec",
                "class": "card bg-warning bg-opacity-10 border-warning border-opacity-40"
            },
            {
                "name": "Jamb",
                "description": "Jamb",
                "logo": "Jamb.webp",
                "serviceID": "jamb",
                "class": "card bg-danger bg-opacity-10 border-danger border-opacity-40"
            }
            ]';
            $user = auth()->user();

        $networks = json_decode($networks,true);
        $data['dstv'] = Order::whereUserId($user->id)->whereType('education')->whereProductLogo('dstv')->sum('price');
        $data['gotv'] = Order::whereUserId($user->id)->whereType('education')->whereProductLogo('gotv')->sum('price');
        $data['startimes'] = Order::whereUserId($user->id)->whereType('education')->whereProductLogo('startimes')->sum('price');
        $data['showmax'] = Order::whereUserId($user->id)->whereType('education')->whereProductLogo('showmax')->sum('price');

        $data['educationlog'] = Order::whereUserId($user->id)->whereType('education')->searchable(['trx'])->orderBy('id', 'desc')->paginate(getPaginate());