app/Http/Controllers/User/GiftcardController.php

    public function buygift()
    {
        $get['pageTitle'] = "Buy Giftcard";
        $get['currency'] = Giftcard::whereStatus(1)->orderBy('name','asc')->get();
---
select * from `giftcards` where `status` = 1 and `giftcards`.`deleted_at` is null order by `name` asc