app/Http/Controllers/User/InternetSmeController.php


           $plans = [];
           $user = auth()->user();
            $data['mtn'] = Order::whereUserId($user->id)->whereType('smedata')->whereProductName('mtn')->sum('price');
            $data['airtel'] = Order::whereUserId($user->id)->whereType('smedata')->whereProductName('airtel')->sum('price');
            $data['glo'] = Order::whereUserId($user->id)->whereType('smedata')->whereProductName('glo')->sum('price');
            $data['etisalat'] = Order::whereUserId($user->id)->whereType('smedata')->whereProductName('etisalat')->sum('price');
            $data['internetlog'] = Order::whereUserId($user->id)->whereType('smedata')->searchable(['trx'])->orderBy('id', 'desc')->paginate(getPaginate());
---
select sum(`price`) as aggregate from `orders` where `user_id` = 1 and `type` = 'smedata' and `product_name` = 'etisalat'
select sum(`price`) as aggregate from `orders` where `user_id` = 1 and `type` = 'smedata' and `product_name` = 'mtn'
select * from `orders` where `user_id` = 1 and `type` = 'smedata' and (`trx` LIKE '%%') order by `id` desc limit 20 offset 0
select count(*) as aggregate from `orders` where `user_id` = 1 and `type` = 'smedata' and (`trx` LIKE '%%')

        {
            $user->ref_balance -= $payment;
        }
        $user->save();
---
update `users` set `balance` = 471, `users`.`updated_at` = '2025-03-18 13:32:29' where `id` = '1'

            {
                $user->ref_balance += $payment;
            }
            $user->save();
---
update `users` set `balance` = 806, `users`.`updated_at` = '2025-03-18 13:32:29' where `id` = '1'