app/Http/Controllers/User/ProfileController.php


        $user->theme = $request->theme;
        session()->put('default_template', $request->theme);
        $user->save();
---
update `users` set `theme` = 'satoshi', `users`.`updated_at` = '2026-04-27 13:23:41' where `id` = 1