app/Http/Controllers/User/UserController.php

    public function home()
    {
        $user  = User::whereId(auth()->user()->id)->first();
        $last30 = date('Y-m-d', strtotime('-30 days'));
		$last7 = date('Y-m-d', strtotime('-7 days'));
		$today = today();
		$dayCount = date('t', strtotime($today));

        $pageTitle                   = 'Dashboard';
        $widget['ref_balance']       = $user->ref_balance;
        $widget['balance']           = $user->balance;
        $widget['total_transaction'] = Transaction::where('user_id', $user->id)->count();
        $widget['deposit']           = Deposit::successful()->where('user_id', $user->id)->sum('amount');
        $widget['total_ticket']      = SupportTicket::where('user_id', $user->id)->count();

        $deposits = Transaction::select('remark', 'created_at')
            ->where('user_id', $user->id)
			->where('trx_type', '+')
			->whereYear('created_at', $today)
			->groupBy([DB::raw("DATE_FORMAT(created_at, '%m')"), 'remark'])
			->selectRaw("SUM(amount) as Deposit")
			->get()
			->groupBy([function ($query) {
				return $query->created_at->format('F');
			}, 'remark']);

            $payouts = Transaction::select('remark', 'created_at')
            ->where('user_id', $user->id)
            ->where('trx_type', '-')
			->whereYear('created_at', $today)
			->groupBy([DB::raw("DATE_FORMAT(created_at, '%m')"), 'remark'])
			->selectRaw("SUM(amount) as Payout")
			->get()
			->groupBy([function ($query) {
				return $query->created_at->format('F');
			}, 'remark']);



                $airtime = Transaction::select('remark', 'created_at')
                    ->where('user_id', $user->id)
                    ->where('remark', 'airtime')
                    ->whereYear('created_at', $today)
                    ->groupBy([DB::raw("DATE_FORMAT(created_at, '%m')"), 'remark'])
                    ->selectRaw("SUM(amount) as Airtime")
                    ->get()
                    ->groupBy([function ($query) {
                        return $query->created_at->format('F');
                }, 'remark']);

                $internet = Transaction::select('remark', 'created_at')
                ->where('user_id', $user->id)
                ->where('remark','internet')
                ->whereYear('created_at', $today)
                ->groupBy([DB::raw("DATE_FORMAT(created_at, '%m')"), 'remark'])
                ->selectRaw("SUM(amount) as Internet")
                ->get()
                ->groupBy([function ($query) {
                    return $query->created_at->format('F');
                }, 'remark']);
                $cabletv = Transaction::select('remark', 'created_at')
                    ->where('user_id', $user->id)
                    ->where('remark', 'cabletv')
                    ->whereYear('created_at', $today)
                    ->groupBy([DB::raw("DATE_FORMAT(created_at, '%m')"), 'remark'])
                    ->selectRaw("SUM(amount) as Cabletv")
                    ->get()
                    ->groupBy([function ($query) {
                        return $query->created_at->format('F');
                }, 'remark']);
                $utility = Transaction::select('remark', 'created_at')
                    ->where('user_id', $user->id)
                    ->where('remark', 'utility')
                    ->whereYear('created_at', $today)
                    ->groupBy([DB::raw("DATE_FORMAT(created_at, '%m')"), 'remark'])
                    ->selectRaw("SUM(amount) as Utility")
                    ->get()
                    ->groupBy([function ($query) {
                        return $query->created_at->format('F');
                }, 'remark']);
                $insurance = Transaction::select('remark', 'created_at')
                    ->where('user_id', $user->id)
                    ->where('remark', 'insurance')
                    ->whereYear('created_at', $today)
                    ->groupBy([DB::raw("DATE_FORMAT(created_at, '%m')"), 'remark'])
                    ->selectRaw("SUM(amount) as Insurance")
                    ->get()
                    ->groupBy([function ($query) {
                        return $query->created_at->format('F');
                }, 'remark']);
---
select * from `users` where `id` = 1 limit 1
select count(*) as aggregate from `transactions` where `user_id` = 1
select count(*) as aggregate from `support_tickets` where `user_id` = 1
select `remark`, `created_at`, SUM(amount) as Deposit from `transactions` where `user_id` = 1 and `trx_type` = '+' and year(`created_at`) = '2026' group by DATE_FORMAT(created_at, '%m'), `remark`
select `remark`, `created_at`, SUM(amount) as Payout from `transactions` where `user_id` = 1 and `trx_type` = '-' and year(`created_at`) = '2026' group by DATE_FORMAT(created_at, '%m'), `remark`
select `remark`, `created_at`, SUM(amount) as Airtime from `transactions` where `user_id` = 1 and `remark` = 'airtime' and year(`created_at`) = '2026' group by DATE_FORMAT(created_at, '%m'), `remark`
select `remark`, `created_at`, SUM(amount) as Internet from `transactions` where `user_id` = 1 and `remark` = 'internet' and year(`created_at`) = '2026' group by DATE_FORMAT(created_at, '%m'), `remark`
select `remark`, `created_at`, SUM(amount) as Cabletv from `transactions` where `user_id` = 1 and `remark` = 'cabletv' and year(`created_at`) = '2026' group by DATE_FORMAT(created_at, '%m'), `remark`
select `remark`, `created_at`, SUM(amount) as Utility from `transactions` where `user_id` = 1 and `remark` = 'utility' and year(`created_at`) = '2026' group by DATE_FORMAT(created_at, '%m'), `remark`
select `remark`, `created_at`, SUM(amount) as Insurance from `transactions` where `user_id` = 1 and `remark` = 'insurance' and year(`created_at`) = '2026' group by DATE_FORMAT(created_at, '%m'), `remark`

		$data['yearCabletv'] = $yearCabletv;
		$data['yearUtility'] = $yearUtilty;
		$data['yearInsurance'] = $yearInsurance;
        $data['ref'] = User::where('ref_by', $user->id)->orderBy('id', 'desc')->count();

        //return $payouts;
        $data['top_earner'] = Transaction::select('user_id',DB::raw('sum(amount) as sums'))
            // ->whereDate('created_at', Carbon::today())
            ->whereYear('created_at', $today)
            ->orderBy('amount','DESC')
            ->take(5)
			->where('trx_type', '+')
            ->with('user')
		    ->groupBy(['user_id'])
			->get();
        $data['user'] =  $user;
        // user Browsing, Country, Operating Log
        $userLoginData = UserLogin::where('created_at', '>=', Carbon::now()->subDay(30))->get(['browser', 'os', 'country']);
---
select count(*) as aggregate from `users` where `ref_by` = 1
select * from `users` where `users`.`id` in (5, 10, 14, 42, 174)
select `browser`, `os`, `country` from `user_logins` where `created_at` >= '2026-03-28 11:20:40'

            return collect($item)->count();
        });
        $data['yearLabels'] = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'];
        $data['logins']      = UserLogin::where('user_id', $user->id)->orderBy('id', 'desc')->skip(1)->take(5)->get();
        $data['current_login']      = UserLogin::where('user_id', $user->id)->orderBy('id', 'desc')->take(1)->first();
        $data['last_login']      = UserLogin::where('user_id', $user->id)->orderBy('id', 'desc')->skip(1)->take(1)->first();
        $data['credit'] = Transaction::where('user_id', $user->id)->orderBy('id', 'desc')->whereTrxType('+')->take(10)->get();
        $data['debit'] = Transaction::where('user_id', $user->id)->orderBy('id', 'desc')->whereTrxType('-')->take(10)->get();
---
select * from `user_logins` where `user_id` = 1 order by `id` desc limit 5 offset 1
select * from `user_logins` where `user_id` = 1 order by `id` desc limit 1
select * from `user_logins` where `user_id` = 1 order by `id` desc limit 1 offset 1
select * from `transactions` where `user_id` = 1 and `trx_type` = '+' order by `id` desc limit 10
select * from `transactions` where `user_id` = 1 and `trx_type` = '-' order by `id` desc limit 10

    public function withdrawMoney()
    {
        $user = Auth::user();
        $withdrawMethod = WithdrawMethod::where('status',1)->where('affiliate','!=',1)->get();
        if($user->vendor == 1)
        {
            $withdrawMethod = WithdrawMethod::where('status',1)->where('affiliate',1)->get();
        }
        $pageTitle = 'Withdraw Money';
        $data['withdraws'] = Withdrawal::where('user_id', Auth::id())->where('status', '!=', 0)->with('method')->orderBy('id','desc')->paginate(getPaginate());
        $data['totalwithdrawvalue'] = Withdrawal::where('user_id', Auth::id())->where('status', '!=', 0)->with('method')->orderBy('id','desc')->sum('amount');
---
select * from `withdraw_methods` where `status` = 1 and `affiliate` = 1
select count(*) as aggregate from `withdrawals` where `user_id` = 1 and `status` != 0
select sum(`amount`) as aggregate from `withdrawals` where `user_id` = 1 and `status` != 0