app/Http/Controllers/User/UtilityLocalController.php

select sum(`price`) as aggregate from `orders` where `user_id` = 1 and `type` = 'utility'
select count(*) as aggregate from `orders` where `user_id` = 1 and `type` = 'utility'
select * from `orders` where `user_id` = 1 and `type` = 'utility' and (`trx` LIKE '%%') order by `id` desc limit 20 offset 0
select count(*) as aggregate from `orders` where `user_id` = 1 and `type` = 'utility' and (`trx` LIKE '%%')
---
        ]';
        $user = auth()->user();
        $networks = json_decode($networks,true);
         $data['value'] = Order::whereUserId($user->id)->whereType('utility')->sum('price');
        $data['count'] = Order::whereUserId($user->id)->whereType('utility')->count();
        $data['utilitylog'] = Order::whereUserId($user->id)->whereType('utility')->searchable(['trx'])->orderBy('id', 'desc')->paginate(getPaginate());