app/Http/Helpers/helpers.php

function loadExtension($key)
{
    $extension = Extension::where('act', $key)->where('status', Status::ENABLE)->first();
---
select * from `extensions` where `act` = 'tawk-chat' and `status` = 1 limit 1

function getContent($dataKeys, $singleQuery = false, $limit = null, $orderById = false)
{
    if ($singleQuery) {
        $content = Frontend::where('data_keys', $dataKeys)->orderBy('id', 'desc')->first();
    } else {
        $article = Frontend::query();
        $article->when($limit != null, function ($q) use ($limit) {
            return $q->limit($limit);
        });
        if ($orderById) {
            $content = $article->where('data_keys', $dataKeys)->orderBy('id')->get();
        } else {
            $content = $article->where('data_keys', $dataKeys)->orderBy('id', 'desc')->get();
---
select * from `frontends` where `data_keys` = 'footer.content' order by `id` desc limit 1
select * from `frontends` where `data_keys` = 'footer.element' order by `id` asc

function gs()
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

function general()
{
    $general = Cache::get('GeneralSetting');
    if (!$general) {
        $general = GeneralSetting::first();
---
select * from `general_settings` limit 1