app/Http/Controllers/Admin/Auth/LoginController.php

select * from `admins` where `username` = 'admin' limit 1
---

        // Check if user exists before attempting login
        $adminModel = config('auth.providers.admins.model', \App\Models\Admin::class);
        $admin = $adminModel::where('username', $credentials['username'])->first();

select * from `admins` where `username` = 'admin' limit 1
---
    protected function sendFailedLoginResponse(Request $request)
    {
        $username = $request->input('username');
        $adminModel = config('auth.providers.admins.model', \App\Models\Admin::class);
        $admin = $adminModel::where('username', $username)->first();