app/Http/Controllers/ApiController.php

select * from `cryptowallets` where `address` = '134bdpqppzYVHJcpe2iXY5sGRYDRZ2GiYS' limit 1
select * from `cryptocurrencies` where `symbol` = 'BTC' limit 1
---
    public function cryptoWallet(Request $request)
    {
       // return response()->json(['status'=>true,'message'=>'Wallet Credited Successfuly'],200);


        $input = $request->all();
        \Log::info('COINREMITTER'. __LINE__ .': '.json_encode($input) ."\n");
        $u = Cryptowallet::where('address', $input['address'])->first();
        $currency = Cryptocurrency::whereSymbol($input['coin_short_name'])->first();