app/Http/Controllers/RndTokenPurchaseController.php

    public function index()
    {
        $purchases = RndTokenPurchase::where('user_id', Auth::id())
            ->latest()
            ->paginate(getPaginate());
---
select * from `rnd_token_purchases` where `user_id` = 1 order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `rnd_token_purchases` where `user_id` = 1

    public function store(Request $request)
    {
        $request->validate([
            'rnd_amount' => 'required|numeric|min:0.00000001',
            'vendor_name' => 'required|string|max:255',
            'vendor_payment_details' => 'required|string|max:1000',
            'payment_proof' => 'required|image|mimes:jpeg,jpg,png|max:2048',
        ]);

        $user = Auth::user();

        $rndAmount = $request->rnd_amount;
        $exchangeRate = RndExchangeRate::getCurrentRate();
        $totalAmount = $rndAmount * $exchangeRate;

        if ($user->balance < $totalAmount) {
            $notify[] = ['error', 'Insufficient balance in your wallet'];
            return back()->withNotify($notify);
        }

        $paymentProof = null;
        if ($request->hasFile('payment_proof')) {
            $paymentProof = fileUploader($request->payment_proof, getFilePath('rnd_payment_proof'));
        }

        $purchase = RndTokenPurchase::create([
            'user_id' => $user->id,
            'rnd_amount' => $rndAmount,
            'exchange_rate' => $exchangeRate,
            'total_amount' => $totalAmount,
            'vendor_name' => $request->vendor_name,
            'vendor_payment_details' => $request->vendor_payment_details,
            'payment_proof' => $paymentProof,
            'status' => 'processing',
        ]);
---
insert into `rnd_token_purchases` (`user_id`, `rnd_amount`, `exchange_rate`, `total_amount`, `vendor_name`, `vendor_payment_details`, `payment_proof`, `status`, `updated_at`, `created_at`) values (1, '10', '204.00000000', 2040, 'Alipay', '1234567890', '69ef4ae25365f1777289954.jpg', 'processing', '2026-04-27 11:39:14', '2026-04-27 11:39:14')