app/Http/Controllers/SiteController.php

    public function index()
    {

        $pageTitle = 'Home';
        $sections  = Page::where('tempname', $this->activeTemplate)->where('slug', '/')->first();
---
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = '/' limit 1