app/Models/RndExchangeRate.php

    public static function getCurrentRate()
    {
        return self::latest()->first()?->rate ?? 204;
---
select * from `rnd_exchange_rates` order by `created_at` desc limit 1