app/Providers/AppServiceProvider.php

select count(*) as aggregate from `loans` where `status` = 0
select count(*) as aggregate from `escrows` where `status` = 8
select count(*) as aggregate from `users` where `status` = 0
select count(*) as aggregate from `support_tickets` where `status` in (0, 2)
select * from `admin_notifications` where `is_read` = 0 order by `id` desc limit 10
select * from `users` where `users`.`id` in (10, 232, 233, 236, 237, 239, 242, 243, 247)
select count(*) as aggregate from `admin_notifications` where `is_read` = 0
select * from `frontends` where `data_keys` = 'seo.data' limit 1
---
    public function boot()
    {
        $general                         = gs();
        $activeTemplate                  = activeTemplate();
        $default = session()->get('default_template');
        $viewShare['general']            = $general;
        $viewShare['activeTemplate']     = $activeTemplate;

        $viewShare['activeTemplateTrue'] = activeTemplate(true);
        $viewShare['language']           = Language::all();
        $viewShare['pages']              = Page::where('tempname', $activeTemplate)->where('slug', "!=", 'home')->where('is_default', 0)->get();
        $viewShare['emptyMessage']       = 'Data not found';

        view()->share($viewShare);

        view()->composer('admin.partials.sidenav', function ($view) {
            $view->with([
                'bannedUsersCount'           => User::banned()->count(),
                'emailUnverifiedUsersCount'  => User::emailUnverified()->count(),
                'disputedEscrowCount'        => Escrow::disputed()->count(),
                'dueLoanCount'               => Loan::due()->count(),
                'pendingLoanCount'           => Loan::pending()->count(),
                'mobileUnverifiedUsersCount' => User::mobileUnverified()->count(),
                'pendingTicketCount'         => SupportTicket::whereIN('status', [Status::TICKET_OPEN, Status::TICKET_REPLY])->count(),
                'pendingDepositsCount'       => Deposit::pending()->count(),
            ]);
        });

        view()->composer('admin.partials.topnav', function ($view) {
            $view->with([
                'adminNotifications'     => AdminNotification::where('is_read', Status::NO)->with('user')->orderBy('id', 'desc')->take(10)->get(),
                'adminNotificationCount' => AdminNotification::where('is_read', Status::NO)->count(),
            ]);
        });

        view()->composer('partials.seo', function ($view) {
            $seo = Frontend::where('data_keys', 'seo.data')->first();