app/Http/Controllers/Admin/AdminRndTokenController.php

    public function exchangeRate()
    {
        $pageTitle = 'RND Exchange Rate Management';
        $currentRate = RndExchangeRate::getCurrentRate();
        $rateHistory = RndExchangeRate::with('updatedBy')
            ->latest()
            ->take(10)
            ->get();
---
select * from `rnd_exchange_rates` order by `created_at` desc limit 10