app/Http/Controllers/Admin/AdminController.php

    public function dashboard()
    {
        $pageTitle = 'Dashboard';
        // User Info
        $widget['total_users'] = User::count();
        $widget['verified_users'] = User::where('status', Status::USER_ACTIVE)->where('ev', Status::VERIFIED)->where('sv', Status::VERIFIED)->count();
        $widget['email_unverified_users'] = User::emailUnverified()->count();
        $widget['mobile_unverified_users'] = User::mobileUnverified()->count();

        $widget['insurance'] = Order::whereType('insurance')->sum('price');
        $widget['airtime'] = Order::whereType('airtime')->sum('price');
        $widget['internet'] = Order::whereType('internet')->sum('price');
        $widget['cabletv'] = Order::whereType('cabletv')->sum('price');
        $widget['electricity'] = Order::whereType('electricity')->sum('price');

        // user Browsing, Country, Operating Log
        $userLoginData = UserLogin::where('created_at', '>=', Carbon::now()->subDay(30))->get(['browser', 'os', 'country']);
---
select count(*) as aggregate from `users` where `status` = 1 and `ev` = 1 and `sv` = 1
select count(*) as aggregate from `users`
select sum(`price`) as aggregate from `orders` where `type` = 'insurance'
select sum(`price`) as aggregate from `orders` where `type` = 'airtime'
select `browser`, `os`, `country` from `user_logins` where `created_at` >= '2026-03-28 11:53:06'

            $trxReport['date']->push($trxData->date);
        });

        $minusTrx = Transaction::where('trx_type', '-')->where('created_at', '>=', Carbon::now()->subDays(30))
            ->selectRaw("SUM(amount) as amount, DATE_FORMAT(created_at,'%Y-%m-%d') as date")
            ->orderBy('created_at')
            ->groupBy('date')
            ->get();
---
select SUM(amount) as amount, DATE_FORMAT(created_at,'%Y-%m-%d') as date from `transactions` where `trx_type` = '-' and `created_at` >= '2026-03-28 11:53:06' group by `date` order by `created_at` asc

        $report['months'] = collect([]);
        $report['deposit_month_amount'] = collect([]);

        $depositsMonth = Deposit::where('created_at', '>=', Carbon::now()->subYear())
            ->where('status', Status::PAYMENT_SUCCESS)
            ->selectRaw("SUM( CASE WHEN status = " . Status::PAYMENT_SUCCESS . " THEN amount END) as depositAmount")
            ->selectRaw("DATE_FORMAT(created_at,'%M-%Y') as months")
            ->orderBy('created_at')
            ->groupBy('months')->get();
---
select SUM( CASE WHEN status = 1 THEN amount END) as depositAmount, DATE_FORMAT(created_at,'%M-%Y') as months from `deposits` where `created_at` >= '2025-04-27 11:53:06' and `status` = 1 group by `months` order by `created_at` asc

            }
        }

        $deposits = Deposit::select('created_at')
			->where('status', 1)
			->whereYear('created_at', $today)
			->groupBy([DB::raw("DATE_FORMAT(created_at, '%m')"), 'method_code'])
			->selectRaw("SUM(amount) as Deposit")
			->get()
			->groupBy([function ($query) {
				return $query->created_at->format('F');
			}, 'method_code']);

		$payouts = Withdrawal::select('created_at')
			->whereYear('created_at', $today)
			->groupBy([DB::raw("DATE_FORMAT(created_at, '%m')"), 'method_id'])
			->selectRaw("SUM(amount) as Payout")
			->get()
			->groupBy([function ($query) {
				return $query->created_at->format('F');
			}, 'method_code']);
---
select `created_at`, SUM(amount) as Deposit from `deposits` where `status` = 1 and year(`created_at`) = '2026' group by DATE_FORMAT(created_at, '%m'), `method_code`
select `created_at`, SUM(amount) as Payout from `withdrawals` where year(`created_at`) = '2026' group by DATE_FORMAT(created_at, '%m'), `method_id`


        $today = today();
        $data['top_earners'] = Transaction::select('user_id',DB::raw('sum(amount) as sums'))
            // ->whereDate('created_at', Carbon::today())
            ->whereYear('created_at', $today)
            ->orderBy('amount','DESC')
            ->take(10)
			->where('trx_type', '+')
            ->with('user')
		    ->groupBy(['user_id'])
			->get();
---
select * from `users` where `users`.`id` in (2, 3, 4, 5, 6, 10, 14, 21, 208, 266)

        $data['mall_order'] = Order::whereStatus('PENDING')->count();
        $data['mpending_order'] = Order::whereStatus('PENDING')->count();
        $data['msuccess_order'] = Order::whereStatus('SUCCESSFUL')->count();
        $data['mdeclined_order'] = Order::whereStatus('DECLINED')->count();
---
select count(*) as aggregate from `orders` where `status` = 'PENDING'

        $widget['escrowpending'] = Escrow::whereStatus(0)->count();
        $widget['escrowcompleted'] = Escrow::whereStatus(1)->count();
        $widget['escrowrunning'] = Escrow::whereStatus(2)->count();
        $widget['escrowdisputed'] = Escrow::whereStatus(8)->count();
        $widget['escrowcancelled'] = Escrow::whereStatus(9)->count();

        $widget['eventpending'] = Event::whereStatus(0)->count();
        $widget['eventapproved'] = Event::whereStatus(1)->count();
        $widget['eventcancelled'] = Event::whereStatus(2)->count();
---
select count(*) as aggregate from `escrows` where `status` = 0
select count(*) as aggregate from `escrows` where `status` = 1
select count(*) as aggregate from `events` where `status` = 0



        $widget['total_debit'] = Transaction::whereTrxType('-')->sum('amount');
        $widget['total_credit'] = Transaction::whereTrxType('+')->sum('amount');

        $widget['pending_withdrawal'] = Withdrawal::whereStatus(2)->sum('amount');
        $widget['approved_withdrawal'] = Withdrawal::whereStatus(1)->sum('amount');
        $widget['declined_withdrawal'] = Withdrawal::whereStatus(3)->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where `trx_type` = '-'
select sum(`amount`) as aggregate from `withdrawals` where `status` = 2