app/Http/Controllers/Admin/BonusController.php

select * from `transaction_bonuses`
---
    public function index()
    {
        $pageTitle = 'Transaction Bonuses';
        $bonuses = TransactionBonus::all();

select * from `transaction_bonuses` where `transaction_bonuses`.`id` = '1' limit 1
---
    public function update(Request $request)
    {

        $request->validate([
            'bonuses' => 'required|array',
            'bonuses.*.id' => 'required|exists:transaction_bonuses,id',
            'bonuses.*.bonus_percentage' => 'required|numeric|min:0|max:100',
            'bonuses.*.bonus_amount' => 'required|numeric',
            'bonuses.*.bonus_type' => 'sometimes|boolean',
            'bonuses.*.is_active' => 'sometimes|boolean'
        ]);

        foreach ($request->bonuses as $bonusData) {
            $bonus = TransactionBonus::find($bonusData['id']);