app/Http/Controllers/Admin/CoinController.php

select * from `cryptocurrencies`
---
    public function index()
    {
        $pageTitle = 'Manage Cryptocurrency';
        $emptyMessage = 'No Coin.';
        $currency = Cryptocurrency::all();