app/Http/Controllers/Admin/ManageUsersController.php

select * from `general_settings` limit 1
---
    public function sendNotificationAll(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'message' => 'required',
            'subject' => 'required',
            'batch_size' => 'nullable|integer|min:1|max:100',
            'delay_minutes' => 'nullable|integer|min:1|max:60',
            'test_mode' => 'nullable|boolean',
        ]);

        if ($validator->fails()) {
            return response()->json(['error' => $validator->errors()->all()]);
        }

        // Get batch settings from request or defaults
        $general = GeneralSetting::first();

select * from `users` where `users`.`id` = '186' limit 1
select * from `notification_logs` where `user_id` = '186' order by `id` desc limit 20 offset 0
select * from `users` where `users`.`id` in (186)
select count(*) as aggregate from `notification_logs` where `user_id` = '186'
---
    public function notificationLog($id)
    {
        $user      = User::findOrFail($id);
        $pageTitle = 'Notifications Sent to ' . $user->username;
        $logs      = NotificationLog::where('user_id', $id)->with('user')->orderBy('id', 'desc')->paginate(getPaginate());