app/Http/Controllers/Admin/RequestAccountController.php

select count(*) as aggregate from `request_payments` where (`trx` LIKE '%%' or exists (select * from `users` where `request_payments`.`user_id` = `users`.`id` and `username` like '%%')) and `status` = '4'
---
    public function request($id)
    {
        $pageTitle = 'Payment Log';
        $log = RequestPayment::latest()->searchable(['trx', 'user:username'])->whereStatus($id)->with('account')->paginate(10);